In [1]:
%load_ext sql
%sql postgresql://postgres:00wasabi00@127.0.0.1/salesdb

'Connected: postgres@salesdb'

### 1.For each product compute the maximum and minimum sales quantites along with the corresponding customer (who purchased the product),dates(i.e., dates oth those maximum and minimum sales quantites) and the state in which the sale transcation took plance

In [2]:
%%sql
with max_min_Table as(
    select prod,max(quant) as max_quant,min(quant) as min_quant
    from sales
    group by prod
),
max_table as(
    select max_min_table.prod,quant,cust,
    concat(day,'/',month,'/',year) "max_date",state
    from max_min_table,sales
    where sales.quant=max_min_table.max_quant 
    and max_min_table.prod = sales.prod
),
min_table as(
    select max_min_table.prod,quant,cust,
    concat(day,'/',month,'/',year) "min_date",state
    from max_min_table,sales
    where sales.quant=max_min_table.min_quant 
    and max_min_table.prod = sales.prod
)

select max_table.prod as "PRODUCT",
max_table.quant as "MAX_Q",
max_table.cust as "MAX_CUST",
max_table.max_date as "MAX_DATE",
max_table.state as "MAX_ST",
min_table.quant as "MIN_Q",
min_table.cust as "MIN_CUST",
min_table.min_date as "MIN_DATE",
min_table.state as "MIN_ST",
round(avg(sales.quant),2) as "AVG_Q"
from max_table
full outer join min_table on max_table.prod=min_table.prod
full outer join sales on max_table.prod=sales.prod
group by max_table.prod,
max_table.quant,
max_table.cust,
max_table.max_date,
max_table.state,
min_table.quant,
min_table.cust, 
min_table.min_date, 
min_table.state

 * postgresql://postgres:***@127.0.0.1/salesdb
10 rows affected.

[('Coke', 4757, 'Knuth', '23/2/2003', 'PA', 81, 'Emily', '22/11/2003', 'CT', Decimal('2525.43')),
 ('Soap', 4954, 'Sam', '6/4/2003', 'PA', 70, 'Emily', '4/9/2003', 'CT', Decimal('2237.29')),
 ('Milk', 4986, 'Emily', '12/11/2002', 'NY', 26, 'Emily', '2/7/2008', 'CT', Decimal('2195.44')),
 ('Yogurt', 4909, 'Helen', '8/8/2007', 'NY', 17, 'Bloom', '25/7/2004', 'PA', Decimal('2457.29')),
 ('Eggs', 4972, 'Bloom', '3/1/2004', 'NJ', 128, 'Emily', '26/11/2002', 'PA', Decimal('2491.27')),
 ('Bread', 4901, 'Helen', '30/5/2008', 'NY', 42, 'Emily', '28/9/2005', 'PA', Decimal('2190.33')),
 ('Fruits', 4793, 'Sam', '15/9/2006', 'NJ', 24, 'Knuth', '26/8/2001', 'NY', Decimal('2434.62')),
 ('Cookies', 4994, 'Knuth', '17/7/2003', 'CT', 132, 'Sam', '9/10/2007', 'CT', Decimal('2502.00')),
 ('Butter', 4969, 'Helen', '4/6/2001', 'NY', 156, 'Knuth', '2/10/2007', 'NY', Decimal('2105.27')),
 ('Pepsi', 4942, 'Knuth', '11/9/2004', 'NY', 94, 'Bloom', '10/7/2000', 'CT', Decimal('2704.33'))]

#### Readme
1.If we want to compute the maximum and minimum sales of each product, the fast way is using GROUP BY with aggregate function MAX() or MIN().
Due to the GROUP BY function constraint, we cannot add customer in SELECT or GROUP BY. If we do that, we will get a full combiantion for each product and customer,well actully only MAX() and MIN() for production

In [3]:
%%sql
with max_min_Table as(
    select prod,max(quant) as max_quant,min(quant) as min_quant
    from sales
    group by prod
)
select *
from max_min_table

 * postgresql://postgres:***@127.0.0.1/salesdb
10 rows affected.

[('Butter', 4969, 156),
 ('Coke', 4757, 81),
 ('Cookies', 4994, 132),
 ('Eggs', 4972, 128),
 ('Pepsi', 4942, 94),
 ('Fruits', 4793, 24),
 ('Yogurt', 4909, 17),
 ('Soap', 4954, 70),
 ('Bread', 4901, 42),
 ('Milk', 4986, 26)]

2.Former class is more like a basic pool, if anyone want to get the unique data combination for product+MAX()+MIN(), he can get the charateristc value from this data set.
3.Because homework want to present who purshed the most quantatity for each product,so we can not present the result in one single non-nusted data set.We need to consider merge three different tables together which contains MAX() table, MIN table and main table Sales which will be used for cacualte average
4.Here is the seperate temperoray tables for MAX() with customer name and MIN() with customer name.

In [4]:
%%sql
with max_min_Table as(
    select prod,max(quant) as max_quant,min(quant) as min_quant
    from sales
    group by prod
),
max_table as(
    select max_min_table.prod,quant,cust,
    concat(day,'/',month,'/',year) "max_date",state
    from max_min_table,sales
    where sales.quant=max_min_table.max_quant 
    and max_min_table.prod = sales.prod
),
min_table as(
    select max_min_table.prod,quant,cust,
    concat(day,'/',month,'/',year) "min_date",state
    from max_min_table,sales
    where sales.quant=max_min_table.min_quant 
    and max_min_table.prod = sales.prod
)
select *
from max_table full outer join min_table on max_table.prod=min_table.prod

 * postgresql://postgres:***@127.0.0.1/salesdb
10 rows affected.

[('Fruits', 4793, 'Sam', '15/9/2006', 'NJ', 'Fruits', 24, 'Knuth', '26/8/2001', 'NY'),
 ('Milk', 4986, 'Emily', '12/11/2002', 'NY', 'Milk', 26, 'Emily', '2/7/2008', 'CT'),
 ('Cookies', 4994, 'Knuth', '17/7/2003', 'CT', 'Cookies', 132, 'Sam', '9/10/2007', 'CT'),
 ('Coke', 4757, 'Knuth', '23/2/2003', 'PA', 'Coke', 81, 'Emily', '22/11/2003', 'CT'),
 ('Yogurt', 4909, 'Helen', '8/8/2007', 'NY', 'Yogurt', 17, 'Bloom', '25/7/2004', 'PA'),
 ('Soap', 4954, 'Sam', '6/4/2003', 'PA', 'Soap', 70, 'Emily', '4/9/2003', 'CT'),
 ('Pepsi', 4942, 'Knuth', '11/9/2004', 'NY', 'Pepsi', 94, 'Bloom', '10/7/2000', 'CT'),
 ('Eggs', 4972, 'Bloom', '3/1/2004', 'NJ', 'Eggs', 128, 'Emily', '26/11/2002', 'PA'),
 ('Butter', 4969, 'Helen', '4/6/2001', 'NY', 'Butter', 156, 'Knuth', '2/10/2007', 'NY'),
 ('Bread', 4901, 'Helen', '30/5/2008', 'NY', 'Bread', 42, 'Emily', '28/9/2005', 'PA')]

5.While the next is very simple, we should emerge using FULL OUTER JION the two temporay table and the SALES origianl tabels and SELECT() the column that we want to show with properate appropriate name. 
6.The reason why there is so many GROUP BY is we use aggregave function AVG() in the end of SELECT. Actuall we can also create another AVG() tempraory table like create MAN() and MIN() table, but only using groupy is more effiecient than JOIN an antoher talbles.